app/Models/BerandaModel.php

    public function reportCustomer($tahun)
    {
        return $this->db->table('customer')
            ->select('MONTH(created_at) month, COUNT(*) total')
            ->where('YEAR(created_at)', $tahun)
            ->groupBy('MONTH(created_at)')
            ->orderBy('MONTH(created_at)')
            ->get()->getResultArray();
---
SELECT MONTH(created_at) month, COUNT(*) total
FROM `customer`
WHERE YEAR(created_at) = '2023'
GROUP BY MONTH(created_at)
ORDER BY MONTH(created_at)