app/Models/BookModel.php

SELECT *
FROM `book`
JOIN `book_category` USING (`book_category_id`)
WHERE `deleted_at` is null
---
    public function getBook($slug = false)
    {
        $query = $this->table('book')
            ->join('book_category', 'book_category_id')
            ->where('deleted_at is null');

        if ($slug == false)
            return $query->get()->getResultArray();