app/Models/SaleModel.php

SELECT `s`.`sale_id`, `s`.`created_at` `tgl_transaksi`, `us`.`id` `user_id`, `us`.`firstname`, `us`.`lastname`, `us`.`username`, `c`.`customer_id`, `c`.`name` `name_cust`, `c`.`no_customer`, SUM(sd.total_price) total
FROM `sale_detail` as `sd`
JOIN `sale` `s` USING (`sale_id`)
JOIN `users` `us` ON `us`.`id` = `s`.`user_id`
LEFT JOIN `customer` `c` USING (`customer_id`)
GROUP BY `s`.`sale_id`
---
    public function getReport()
    {
        return $this->db->table('sale_detail as sd')
            ->select('s.sale_id, s.created_at tgl_transaksi, us.id user_id, us.firstname, us.lastname, , us.username, c.customer_id, c.name name_cust, c.no_customer, SUM(sd.total_price) total')
            ->join('sale  s', 'sale_id')
            ->join('users us', 'us.id = s.user_id')
            ->join('customer c', 'customer_id', 'left')
            ->groupBy('s.sale_id')
            ->get()->getResultArray();