app/Models/UsersModel.php

    public function getUsers($id = false)
    {
        $query = $this->select('users.id, firstname, lastname, username, email, gs.group_id, g.name group_name')
            ->join('auth_groups_users gs', 'users.id=gs.user_id')
            ->join('auth_groups g', 'g.id = gs.group_id');
        if ($id === false) {
            return $query->findAll();
---
SELECT `users`.`id`, `firstname`, `lastname`, `username`, `email`, `gs`.`group_id`, `g`.`name` `group_name`
FROM `users`
JOIN `auth_groups_users` `gs` ON `users`.`id`=`gs`.`user_id`
JOIN `auth_groups` `g` ON `g`.`id` = `gs`.`group_id`
WHERE `users`.`deleted_at` IS NULL